lesson-6/LabReports/app/views/lab_reports/_form.html.erb

    <%= form.label :user_id, style: "display: block" %>
    <%= form.collection_select :user_id, User.order(:id), :id, :first_ name %>
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC