lesson-6/LabReports/app/views/lab_reports/_lab_report.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <strong>User:</strong>
    <%= User.find(lab_report.user_id).attributes.values_at('last_name', 'first_name').join(' ') %>