lesson-6/LabReports/app/views/lab_reports/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= lab_report.grade %></td>
        <td><%= User.find(lab_report.user_id).attributes.values_at('last_name', 'first_name').join(' ') %></td>