lesson-6/LabReports/app/controllers/lab_reports_controller.rb

  def index
    @lab_reports = LabReport.all
---
SELECT "lab_reports".* FROM "lab_reports"

  def create
    @lab_report = LabReport.new(lab_report_params)

    respond_to do |format|
      if @lab_report.save
---
INSERT INTO "lab_reports" ("title", "description", "grade", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "Title"], ["description", "12345"], ["grade", "None"], ["user_id", 1], ["created_at", "2024-05-23 09:07:07.217368"], ["updated_at", "2024-05-23 09:07:07.217368"]]

  def destroy
    @lab_report.destroy!
---
DELETE FROM "lab_reports" WHERE "lab_reports"."id" = ?  [["id", 1]]

  def set_lab_report
    @lab_report = LabReport.find(params[:id])
---
SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]