lesson-6/LabReports/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["email", "anton@example.com"], ["first_name", "Anton"], ["last_name", "Hashabov"], ["created_at", "2024-05-21 09:22:04.838702"], ["updated_at", "2024-05-21 09:22:04.838702"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save